zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Inc/py32f031_ll_adc.h
/**
  ******************************************************************************
  * @file    py32f031_ll_adc.h
  * @author  MCU Application Team
  * @brief   Header file of ADC LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32F031_LL_ADC_H
#define __PY32F031_LL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f0xx.h"
#include "py32f031_ll_bus.h"

/** @addtogroup PY32F031_LL_Driver
  * @{
  */

#if defined (ADC1)

/** @defgroup ADC_LL ADC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Constants ADC Private Constants
  * @{
  */

/* Internal mask for ADC group regular trigger:                               */
/* To select into literal LL_ADC_REG_TRIG_x the relevant bits for:            */
/* - regular trigger source                                                   */
/* - regular trigger edge                                                     */
#define ADC_REG_TRIG_EXT_EDGE_DEFAULT       (ADC_CFGR1_EXTEN_0)

/* Mask containing trigger source masks for each of possible                  */
/* trigger edge selection duplicated with shifts [0; 4; 8; 12]                */
/* corresponding to {SW start; ext trigger; ext trigger; ext trigger}.        */
#define ADC_REG_TRIG_SOURCE_MASK            (((LL_ADC_REG_TRIG_SOFTWARE & ADC_CFGR1_EXTSEL) << (4U * 0U)) | \
                                             ((                           ADC_CFGR1_EXTSEL) << (4U * 1U)) | \
                                             ((                           ADC_CFGR1_EXTSEL) << (4U * 2U)) | \
                                             ((                           ADC_CFGR1_EXTSEL) << (4U * 3U))  )

/* Mask containing trigger edge masks for each of possible                    */
/* trigger edge selection duplicated with shifts [0; 4; 8; 12]                */
/* corresponding to {SW start; ext trigger; ext trigger; ext trigger}.        */
#define ADC_REG_TRIG_EDGE_MASK              (((LL_ADC_REG_TRIG_SOFTWARE & ADC_CFGR1_EXTEN) << (4U * 0U)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)              << (4U * 1U)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)              << (4U * 2U)) | \
                                             ((ADC_REG_TRIG_EXT_EDGE_DEFAULT)              << (4U * 3U))  )

/* Definition of ADC group regular trigger bits information.                  */
#define ADC_REG_TRIG_EXTSEL_BITOFFSET_POS  ( 6U) /* Value equivalent to POSITION_VAL(ADC_CFGR1_EXTSEL) */
#define ADC_REG_TRIG_EXTEN_BITOFFSET_POS   (10U) /* Value equivalent to POSITION_VAL(ADC_CFGR1_EXTEN) */

/* Internal mask for ADC group regular sequencer:                             */
/* To select into literal LL_ADC_REG_RANK_x the relevant bits for:            */
/* - sequencer register offset                                                */
/* - sequencer rank bits position into the selected register                  */

/* Internal register offset for ADC group regular sequencer configuration */
/* (offset placed into a spare area of literal definition) */
#define ADC_SEQR0_REGOFFSET                 0x00000000U
#define ADC_SEQR1_REGOFFSET                 0x00000100U
#define ADC_REG_SEQRX_REGOFFSET_MASK        (ADC_SEQR0_REGOFFSET | ADC_SEQR1_REGOFFSET )

#define ADC_REG_RANK_ID_SEQRX_MASK          (0x1F)

/* Definition of ADC group regular sequencer bits information to be inserted  */
/* into ADC group regular sequencer ranks literals definition.                */
#define ADC_REG_RANK_1_SEQRX_BITOFFSET_POS  ( 0U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ0) */
#define ADC_REG_RANK_2_SEQRX_BITOFFSET_POS  ( 4U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ1) */
#define ADC_REG_RANK_3_SEQRX_BITOFFSET_POS  ( 8U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ2) */
#define ADC_REG_RANK_4_SEQRX_BITOFFSET_POS  (12U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ3) */
#define ADC_REG_RANK_5_SEQRX_BITOFFSET_POS  (16U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ4) */
#define ADC_REG_RANK_6_SEQRX_BITOFFSET_POS  (20U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ5) */
#define ADC_REG_RANK_7_SEQRX_BITOFFSET_POS  (24U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ6) */
#define ADC_REG_RANK_8_SEQRX_BITOFFSET_POS  (28U) /* Value equivalent to POSITION_VAL(ADC_SEQR0_SQ7) */
#define ADC_REG_RANK_9_SEQRX_BITOFFSET_POS  ( 0U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ8) */
#define ADC_REG_RANK_10_SEQRX_BITOFFSET_POS ( 4U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ9) */
#define ADC_REG_RANK_11_SEQRX_BITOFFSET_POS ( 8U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ10) */
#define ADC_REG_RANK_12_SEQRX_BITOFFSET_POS (12U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ11) */
#define ADC_REG_RANK_13_SEQRX_BITOFFSET_POS (16U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ12) */
#define ADC_REG_RANK_14_SEQRX_BITOFFSET_POS (20U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ13) */
#define ADC_REG_RANK_15_SEQRX_BITOFFSET_POS (24U) /* Value equivalent to POSITION_VAL(ADC_SEQR1_SQ14) */

/* Internal mask for ADC channel:                                             */
/* To select into literal LL_ADC_CHANNEL_x the relevant bits for:             */
/* - channel identifier defined by number                                     */
/* - channel differentiation between external channels (connected to          */
/*   GPIO pins) and internal channels (connected to internal paths)           */
/* - channel sampling time defined by SMPRx register offset                   */
/*   and SMPx bits positions into SMPRx register                              */
#define ADC_CHANNEL_ID_NUMBER_MASK                (ADC_CFGR1_AWDCH)
#define ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS       (ADC_CFGR1_AWDCH_Pos)
/* Equivalent mask of ADC_CHANNEL_NUMBER_MASK aligned on register LSB (bit 0) */
#define ADC_CHANNEL_ID_NUMBER_MASK_POSBIT0        0x0000000FU /* Equivalent to shift: (ADC_CHANNEL_NUMBER_MASK >> POSITION_VAL(ADC_CHANNEL_NUMBER_MASK)) */

/* Channel differentiation between external and internal channels */
#define ADC_CHANNEL_ID_INTERNAL_CH         (0x80000000U) /* Marker of internal channel */
#define ADC_CHANNEL_ID_INTERNAL_CH_MASK    (ADC_CHANNEL_ID_INTERNAL_CH)
#define ADC_CHANNEL_ID_MASK                (ADC_CHANNEL_ID_NUMBER_MASK | ADC_CHANNEL_ID_INTERNAL_CH_MASK)

/* Internal register offset for ADC channel sampling time configuration */
/* (offset placed into a spare area of literal definition) */
#define ADC_SMPR0_REGOFFSET                0x00000000U
#define ADC_SMPR1_REGOFFSET                0x00000020U
#define ADC_CHANNEL_SMPRX_REGOFFSET_MASK   (ADC_SMPR0_REGOFFSET | ADC_SMPR1_REGOFFSET )

#define ADC_CHANNEL_SMPx_BITOFFSET_MASK    0x0000001FU

/* Definition of channels ID number information to be inserted into           */
/* channels literals definition.                                              */
#define ADC_CHANNEL_0_NUMBER               (0x00000000U)
#define ADC_CHANNEL_1_NUMBER               (                                                            ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_2_NUMBER               (                                        ADC_CFGR1_AWDCH_1                    )
#define ADC_CHANNEL_3_NUMBER               (                                        ADC_CFGR1_AWDCH_1 | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_4_NUMBER               (                    ADC_CFGR1_AWDCH_2                                        )
#define ADC_CHANNEL_5_NUMBER               (                    ADC_CFGR1_AWDCH_2                     | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_6_NUMBER               (                    ADC_CFGR1_AWDCH_2 | ADC_CFGR1_AWDCH_1                    )
#define ADC_CHANNEL_7_NUMBER               (                    ADC_CFGR1_AWDCH_2 | ADC_CFGR1_AWDCH_1 | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_8_NUMBER               (ADC_CFGR1_AWDCH_3                                                            )
#define ADC_CHANNEL_9_NUMBER               (ADC_CFGR1_AWDCH_3                                         | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_10_NUMBER              (ADC_CFGR1_AWDCH_3                     | ADC_CFGR1_AWDCH_1                    )
#define ADC_CHANNEL_11_NUMBER              (ADC_CFGR1_AWDCH_3                     | ADC_CFGR1_AWDCH_1 | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_12_NUMBER              (ADC_CFGR1_AWDCH_3 | ADC_CFGR1_AWDCH_2                                        )
#define ADC_CHANNEL_13_NUMBER              (ADC_CFGR1_AWDCH_3 | ADC_CFGR1_AWDCH_2                     | ADC_CFGR1_AWDCH_0)
#define ADC_CHANNEL_14_NUMBER              (ADC_CFGR1_AWDCH_3 | ADC_CFGR1_AWDCH_2 | ADC_CFGR1_AWDCH_1                    )

